# TypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDataInstanceAddingIntoDocumentEventArgs..::..TypeId Property
ExternalDataInstanceAddingIntoDocumentEventArgs Class See Also
---
The type id of the newl external data instance that is being added.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ElementId TypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TypeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
```

# See Also
ExternalDataInstanceAddingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace